{
  "jobs": [
    {
      "id": 1,
      "slug": "gtm-strategy-delivery-ankar",
      "title": "GTM, Strategy & Delivery",
      "company": "Ankar",
      "location": "United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Technology",
      "image": "https://ui-avatars.com/api/?name=Ankar&background=000&color=fff&size=128&bold=true",
      "description": "GTM, Strategy & Delivery\n\nLocation: Greater London\n\nAbout Ankar\nThe way companies innovate is broken. The systems built to create and protect ideas can’t keep up with the pace of change. Today, 90% of S&P 500 company value is intangible (e.g., in intellectual property) - yet R&D and IP teams spend half their time buried in manual work. We’re here to fix that. Ankar is building the AI operating system for innovation, reinventing how companies generate and protect their inventions. Our platform orchestrates how ideas become defensible IP with a suite of AI modules such as patent drafting, office action response, and infringement detection.\n\nWe’re at an inflection point:\n- We’ve raised >24M to date from Tier-1 VCs like Atomico, Index Ventures, Norrsken, Daphni, and angels like the Founder of Hugging Face, CEO from Datadog, and Leaders from Deep Mind and OpenAI.\n- We’re already working with the world’s most innovative companies including Fortune 500 company L’Oréal and global law firm Vorys.\n- Expanding our world-class team with alumni from Palantir, Amazon, and BCG to tackle the 1T+ innovation market.\n\nWhat you’ll be doing\nWe’re looking for a hands‑on generalist who can bridge product, engineering, and go‑to‑market — embedding with customers and internal teams to design, prototype, and deploy proofs of concept and new products.\n- Lead end‑to‑end delivery of customer POCs and new product rollouts.\n- Partner with customers to design and deliver high‑value POCs and new products.\n- Work closely with customer teams to ensure successful adoption and value delivery.\n- Turn customer feedback into clear product requirements.\n- Spot emerging product opportunities across deployments.\n\nWhat we are looking for\n- 2+ years of experience in a high‑ownership environment (e.g., startups, consulting, banking, or similar fast‑moving roles).\n- A builder’s mindset. You thrive in ambiguity, iterate quickly, and love creating order out of chaos.\n- Extreme ownership. You see problems before they happen, you take responsibility, and you deliver.\n- [Bonus points] Experience designing and delivering proof of concepts and new products to enterprise customers.\n\nWhat else you might want to know\n- Location: Hoxton Square, London (office-first policy with flexibility)\n- Contract: Full‑time\n- Compensation: Competitive salaries + substantial equity package under the tax‑efficient EMI scheme.\n- Hiring process: (1) 30min introductory chat, (2) 2hr onsite interview, (3) 20min final in-person meeting.\n- Visa sponsorship: Yes",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "https://jobs.ashbyhq.com/ankar"
    },
    {
      "id": 2,
      "slug": "engineer-digital-library-university-of-leeds",
      "title": "Engineer (Digital Library)",
      "company": "University of Leeds",
      "location": "Leeds, England, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Information Technology",
      "image": "https://ui-avatars.com/api/?name=University+of+Leeds&background=random&color=fff&size=128&bold=true",
      "description": "Engineer (Digital Library)\n\nThe interviews will be held on the Wednesday 4th March 2026\n\nThis role will be based on the university campus with scope for it to be undertaken in a hybrid manner. We are also open to discussing flexible working arrangements.\n\nAre you interested in using your development and support knowledge and skills in a diverse Product Engineering function for Digital Library services? Are you an enthusiastic and driven individual with a desire to be part of a team delivering high-quality IT services to support digital access to the Libraries’ Cultural Collections?\n\nThe University of Leeds is one of the top 135 universities in the world. We have a truly global community, with more than 39,000 students from 170 different countries and over 9,000 staff of 100 different nationalities.\n\nThe University’s Cultural Collections comprise hundreds of thousands of rare books, manuscripts, archives, art works and museum artefacts. Our collections offer a rich resource for researchers, students and the wider research community.\n\nAs an Engineer with Python development skills, you will be working as part of a team to deliver the technical infrastructure and services of the Digital Library Infrastructure Project (DLIP), during and beyond the life of the project. DLIP is a cornerstone project to support the University in meeting the objectives set out in the Digital Transformation component of the Universal Values, Global Changes, University of Leeds Strategy 2020 to 2030. It implements the Digital Futures strand of the Libraries Vision.\n\nThe Digital Library Infrastructure Project will deliver a sustainable digital libraries research and education infrastructure, respond to the rapidly changing expectations of our students, staff, and partners and support the aims of University’s strategy.\n\nYou will be working as part of the DLIP team to implement:\nAn updated cultural collections website to improve user experience, access, and opportunities for digital creativity and cultures, featuring digital content presented in the IIIF standard;\nA modern data platform to merge data from different sources into a linked data format (Linked Art) to make it more effective, in combination with a graph-based search engine, for search, research, and teaching;\nImprovements to the process for storing and managing digital surrogates and digital born content to reduce risk and increase access;\nA foundational cloud infrastructure for digital humanities research and teaching.\n\nYou will utilise your skills, knowledge and experience to support the DLIP project, working as part of the team to design, develop and implement solutions. You will have experience of development using Python, and database development through SQL. You will also use your experience of analysing and diagnosing issues in applications to support the project.\n\nWorking in a complex environment, you will be liaising closely with colleagues with both technical and domain subject matter expertise, and working with a diverse range of stakeholders, and providing high quality support for applications and maintaining thorough documentation.\n\nDLIP is implementing innovative approaches and, in order to apply appropriate technical solutions, you will develop a digital library domain knowledge and an evolving understanding of the landscape, including the field of digital asset management and digital scholarship, use of data schemas and of interoperable standards such as IIIF (the International Image Interoperability Framework)\n\nPlease note that due to Home Office visa requirements, this role may only be suitable for first-time Skilled Worker visa applicants if they are eligible for salary concessions. For more information please visit: www.gov.uk/skilled-worker-visa For research and academic posts, we will consider eligibility under the Global Talent visa. For more information please visit: https://www.gov.uk/global-talent.\n\nWhat We Offer In Return:\n- 26 days holiday plus approx.16 Bank Holidays/days that the University is closed by custom (including Christmas) – That’s 42 days a year!\n- Generous pension scheme plus life assurance– the University contributes 14.5%\n- Health and Wellbeing: Discounted staff membership options at The Edge, our state-of-the-art Campus gym, with a pool, sauna, climbing wall, cycle circuit, and sports halls.\n- Personal Development: Access to courses run by our Organisational Development & Professional Learning team.\n- Access to on-site childcare, shopping discounts and travel schemes are also available.\n\nTo explore the post further or for any queries you may have, please contact:\nAnna Cale, Operations Manager\nEmail: a.p.cale@leeds.ac.uk",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "https://jobs.leeds.ac.uk/vacancy.aspx?ref=CSUIT1833"
    },
    {
      "id": 3,
      "slug": "teach-english-abroad-full-time-visa-health-english-1",
      "title": "Teach English Abroad - Full-Time (Visa & Health)",
      "company": "English 1",
      "location": "Luton, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Education",
      "image": "https://ui-avatars.com/api/?name=English+1&background=random&color=fff&size=128&bold=true",
      "description": "Teach English Abroad - Full-Time (Visa & Health)\n\nA language education organization is recruiting entry-level English teachers to teach young learners aged 3–16 in China. This full-time role emphasizes engaging methodologies alongside comprehensive training for candidates who hold a bachelor's degree and are genuinely interested in education.\n\nThe position offers benefits such as a competitive salary, performance bonuses, health insurance, and visa sponsorship, making it an excellent starting point for recent graduates or professionals looking to begin their teaching careers abroad.\n\nKey Details:\n- Role: English Teacher (Young Learners)\n- Location: Recruiting from Luton (Deployment to China)\n- Bachelor's degree required\n- Comprehensive training provided\n- Visa sponsorship and health insurance included",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.learn4good.com/jobs/luton/uk/education/4797167099/e/"
    },
    {
      "id": 4,
      "slug": "pelvic-urology-oncology-robotic-fellow-university-hospitals-plymouth",
      "title": "Pelvic Urology Oncology Robotic Fellow",
      "company": "University Hospitals Plymouth NHS Trust",
      "location": "Plymouth, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "£73,992 per annum",
      "image": "https://ui-avatars.com/api/?name=University+Hospitals+Plymouth&background=random&color=fff&size=128&bold=true",
      "description": "Pelvic Urology Oncology Robotic Fellow (StR Higher)\n\nJob Summary:\nThe Urology Department, led by Mr. Paul Hunter-Campbell, consists of 14 consultants and a team of nine middle‑grade doctors, trainees, foundation doctors, surgical care practitioners, and specialist nurses providing 24‑hour on‑call cover. Our outpatient department at the Chestnut Unit offers one‑stop clinics and the state‑of‑the‑art Da Vinci X robotic system in the Freedom Operating Theatres for robotic surgeries.\n\nServices Provided:\n- Complex kidney stone surgery\n- Functional and neuro‑urology\n- Andrological care for the entire Peninsula\n- Bladder outflow obstruction treatments including HoLEP\n- Paediatric urology, including laparoscopic procedures\n- Kidney transplantation\n- Uro‑oncology services for prostate, bladder, renal, and penile cancers\n- Tertiary referrals for radical procedures\n\nMain Duties:\nThe fellowship provides in‑depth experience in robotic pelvic oncology surgery, particularly radical prostatectomy and cystectomy, with the goal of enabling independent robotic surgery practice. Overseas applicants must be eligible for GMC registration and have an overall IELTS score of at least 7.5.\n\nResponsibilities:\n- Comprehensive robotic training focused on pelvic malignancies\n- Managing urological oncology patients\n- Collaborating with multidisciplinary teams\n- Contributing to clinical research and audit projects\n- Participating in teaching and training\n\nQualifications:\n- Completed FRCS Urol\n- On the UK Specialist Register or eligible within six months\n\nPay Scheme: Hospital medical and dental staff\nSalary: £73,992 per annum\nContract: Fixed term (12 months)",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.learn4good.com/jobs/plymouth/uk/doctor_of_medicine/4796876969/e"
    },
    {
      "id": 5,
      "slug": "ib-dp-teacher-multi-subject-greater-london",
      "title": "IB DP Teacher (Multi-Subject)",
      "company": "IB World School",
      "location": "Greater London, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Education",
      "salary": "£40,000 - £60,000 per year",
      "image": "https://ui-avatars.com/api/?name=IB+World+School&background=random&color=fff&size=128&bold=true",
      "description": "IB DP Teacher (Multi-Subject) – Permanent, Visa Sponsorship\n\nAn educational institution in Greater London is seeking passionate teachers for the International Baccalaureate Diploma Programme (IB DP). \n\nPositions are available to teach various subjects such as Economics, Mathematics, and Theory of Knowledge starting in August 2026. Candidates with interdisciplinary strengths are encouraged to apply. \n\nKey Information:\n- Subjects: Economics, Mathematics, TOK\n- Start Date: August 2026\n- Application Deadline: 15 January 2026\n- Visa: Skilled worker visa sponsorship may be available for the right candidates.\n- Role: Permanent, Full-time",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.learn4good.com/jobs/london/uk/education/4797140216/e/"
    },
    {
      "id": 6,
      "slug": "senior-monitoring-manager-compliance-monitoring-santander-uk",
      "title": "Senior Monitoring Manager – Compliance Monitoring",
      "company": "Santander",
      "location": "Milton Keynes, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Legal",
      "salary": "",
      "image": "https://ui-avatars.com/api/?name=Santander&background=random&color=fff&size=128&bold=true",
      "description": "Senior Monitoring Manager – Compliance Monitoring (Second Line) | S4 | Risk & Compliance\n\nJoin our community: Ready to take the next step in your risk and compliance career and lead where it counts? We’re offering an exciting opportunity to step into a high-impact, future‑focussed leadership role at the heart of our second line Monitoring & Testing team.\n\nThe difference you’ll make:\n- Managing the delivery of multiple compliance monitoring reviews across diverse regulated activities.\n- Managing and developing colleagues to build technical capability and foster a learning culture.\n- Supporting a forward‑looking, data‑led monitoring plan aligned to regulatory and internal risk priorities.\n- Providing subject matter input on key regulatory areas including Consumer Duty, SMCR, and Product Governance.\n- Supporting the integration of analytics and insight into our monitoring methodology.\n- Providing clear, actionable insights to senior leaders and risk owners.\n\nWhat you’ll bring:\n- Deep experience in second line compliance monitoring or internal audit.\n- Strong knowledge of FCA conduct and regulatory expectations.\n- Proven ability to lead complex reviews and manage assurance teams.\n- Experience working within a non‑financial risk framework.\n\nWhat else you need to know:\nThis role is based in Glasgow or Milton Keynes. Santander will pay the employer mandatory government fees that are required to pay in connection with visa sponsorship. You may be liable for your own personal employee immigration and relocation costs.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.learn4good.com/jobs/milton-keynes/uk/finance/4797179049/e/"
    },
    {
      "id": 7,
      "slug": "assistant-general-manager-qima-cafe-london",
      "title": "Assistant General Manager",
      "company": "Qima Café",
      "location": "London, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Hospitality",
      "salary": "£35,000 - £40,000 per year",
      "image": "https://ui-avatars.com/api/?name=Qima+Cafe&background=random&color=fff&size=128&bold=true",
      "description": "Assistant General Manager (Guest Experience Lead)\n\nWhere tree-to-cup hospitality meets world-class coffee. At Qima Café, we bring one of the world’s most extraordinary coffee journeys directly to London.\n\nWhat you’ll do:\n- Lead the FOH team on the floor, ensuring warm, attentive, and efficient service.\n- Drive sales by championing upselling of brunch, plated desserts, and retail items.\n- Conduct daily service briefings and keep the team aligned on priorities.\n- Train and mentor staff in upselling and guest etiquette.\n- Collaborate with barista and kitchen teams for seasonal launches.\n- Act as first responder to guest complaints.\n\nWhat we’re looking for:\n- Proven leadership experience in hospitality (specialty coffee or premium dining).\n- A natural host with strong communication skills.\n- Ability to coach and motivate a team in a fast-paced environment.\n- Ambition to grow into higher operational leadership roles.\n\nWhat we offer:\n- Competitive pay (£35k-£40k OTE).\n- Clear progression opportunities across the Origins 1450 ecosystem.\n- Staff discounts and company events.\n- UK Visa Sponsorship.\n\nLocation: Warren Street, London\nHours: Full-time 45 hour contract",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.glassdoor.co.uk/job-listing/assistant-general-manager-qima-caf%C3%A9-JV_IC2671300_KO0,25_KE26,35.htm?jl=1010001932183"
    },
    {
      "id": 8,
      "slug": "rev-celerator-graduate-programme-2026-ios-software-engineer-revolut",
      "title": "Rev-celerator Graduate Programme 2026 iOS Software Engineer",
      "company": "Revolut",
      "location": "London, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Information Technology",
      "salary": "Competitive",
      "image": "https://ui-avatars.com/api/?name=Revolut&background=random&color=fff&size=128&bold=true",
      "description": "Rev-celerator Graduate Programme 2026 iOS Software Engineer\n\nAbout the Rev-celerator Graduate Programme:\nThe Rev-celerator Graduate Programme is built for ambitious graduates who want to launch their careers in fintech. Over this 12-month programme, you’ll work on real projects, solve complex challenges, and make an impact from day one.\n\nWhat you'll be doing:\n- Collaborating with Product Designers on new feature design and prototyping.\n- Building user experiences from wireframes and mockups through to release.\n- Partnering with teams across departments to deliver elegant solutions.\n- Helping define and maintain visual guidelines for consistency across the app.\n- Prototyping new interactions and iterating based on feedback.\n- Developing expertise with the iOS SDK.\n\nWhat you'll need:\n- A predicted or achieved 2:1 (or equivalent grade) in Computer Science, Maths, Physics, or similar.\n- To have graduated in 2024, 2025, or 2026.\n- A portfolio of coding projects or open-source contributions.\n- Experience with Swift and iOS SDK.\n- Full-time availability from September 2026.\n\nVisa & Relocation Support:\nRevolut will support international applicants with visa assistance, travel costs, and your first month of accommodation (conditions apply).",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.totaljobs.com/job/efea42cf-2b04-475c-946f-b0191c0c00bc/application"
    },
    {
      "id": 9,
      "slug": "sous-chef-the-inn-collection-group-york",
      "title": "Sous Chef",
      "company": "The Inn Collection Group",
      "location": "York, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Hospitality",
      "salary": "",
      "image": "https://ui-avatars.com/api/?name=The+Inn+Collection+Group&background=random&color=fff&size=128&bold=true",
      "description": "Sous Chef - The Black Swan\n\nThe Inn Collection Group is a multi-award-winning pubs with rooms company, proudly located in some of the most outstanding destinations across the North of England and Wales.\n\nHow we say thank you!\n- Celebrate your birthday with an extra paid holiday.\n- Build your future with support from our Lead-Inn development program.\n- Take the time you need to rest and recharge; Paid Breaks are on us.\n- Enjoy 50% off food at any of our Inns.\n- Relax with a stay at any of our Inns during Jan, Feb, and March for just £1.\n- 1/3 off room bookings all year round.\n- Tronc (tips) and Employee Assistance Programme.\n\nYou’ll fit right inn:\nAs Sous Chef, you’ll be at the heart of our kitchen, ensuring every dish showcases the best of fresh, quality ingredients. Working closely with the Head Chef, you’ll help maintain consistent excellence and bring creativity to the role.\n\nBeyond cooking, your role will include stock control, ordering, and overseeing kitchen cleanliness. You’ll take charge in the Head Chef’s absence, confidently managing the team and ensuring smooth operations.\n\nVisa & Accommodation:\nThis role comes with the added benefit of colleague accommodation. We welcome applications from Skilled Worker visa holders and can transfer Certificates of Sponsorship.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://careers.inncollectiongroup.com/jobs/4207908-sous-chef"
    },
    {
      "id": 10,
      "slug": "laser-technician-shapins-clinic-london",
      "title": "Laser Technician",
      "company": "SHAPINS Clinic",
      "location": "Kensington, London, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "£26,000 - £30,000 per year",
      "image": "https://ui-avatars.com/api/?name=SHAPINS+Clinic&background=random&color=fff&size=128&bold=true",
      "description": "Laser Technician - SHAPINS Clinic\n\nAt SHAPINS Clinic, we specialise in advanced skin and body treatments that help clients look and feel their best. Our mission is to provide safe, effective, and personalised treatments delivered with compassion, integrity, and excellence.\n\nKey Responsibilities:\n- Carry out advanced skin treatments including: HydroFacial, Microneedling RF, Chemical Peels, Skin Tightening (HIFU, Radio Frequency), and Laser Hair Removal.\n- Conduct in-depth client consultations and skin analysis.\n- Develop bespoke treatment plans tailored to individual client needs.\n- Educate clients on skincare and recommend homecare products.\n- Maintain accurate client records and treatment notes.\n- Ensure high standards of hygiene, safety, and professionalism.\n\nRequirements:\n- NVQ Level 3/4 (or equivalent) in Beauty Therapy / Aesthetics.\n- Experience delivering advanced skin treatments (minimum 1–2 years preferred).\n- Strong knowledge of skin health, conditions, and treatment options.\n- Excellent communication and client care skills.\n\nBenefits:\n- Company pension and employee discount.\n- Flexitime and referral programme.\n- UK visa sponsorship available for the right candidate.\n\nLocation: Kensington, London (In person)",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.glassdoor.co.uk/job-listing/laser-technician-shapins-clinic-JV_IC3527326_KO0,16_KE17,31.htm?jl=1010001939220"
    },
    {
      "id": 11,
      "slug": "sous-chef-the-black-swan-inn-york",
      "title": "Sous Chef",
      "company": "The Black Swan Inn",
      "location": "York, United Kingdom",
      "country": "uk",
      "type": "Full-time",
      "industry": "Hospitality",
      "salary": "£33,000 per year",
      "image": "https://ui-avatars.com/api/?name=The+Black+Swan+Inn&background=random&color=fff&size=128&bold=true",
      "description": "Sous Chef - The Black Swan Inn\n\nThe Inn Collection Group is a multi-award-winning pubs with rooms company, proudly located in some of the most outstanding destinations across the North of England and Wales.\n\nKey Benefits:\n- Celebrate your birthday with an extra paid holiday.\n- Support from our Lead-Inn development program.\n- Paid Breaks are on us.\n- 50% off food at any of our Inns.\n- Relax with a stay for just £1 during Jan-March.\n- 1/3 off room bookings all year round.\n- Tronc (tips) and Employee Assistance Programme.\n\nThe Role:\nAs Sous Chef, you’ll be at the heart of our kitchen, ensuring every dish showcases the best of fresh, quality ingredients. Working closely with the Head Chef, you’ll help maintain consistent excellence across all areas of the kitchen.\n\nBeyond cooking, your role will include stock control, ordering from nominated suppliers, and overseeing kitchen cleanliness. You’ll take charge in the Head Chef’s absence, confidently managing the team.\n\nVisa & Accommodation:\nThis role comes with the added benefit of colleague accommodation. We welcome applications from Skilled Worker visa holders and can transfer Certificates of Sponsorship.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.linkedin.com/jobs/view/sous-chef-at-the-inn-collection-group-4363849846?originalSubdomain=uk"
    },
    {
      "id": 12,
      "slug": "senior-data-engineer-aws-ai-talent-sydney",
      "title": "Senior Data Engineer (AWS)",
      "company": "AI Talent",
      "location": "Sydney, NSW, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Information Technology",
      "salary": "Competitive",
      "image": "https://ui-avatars.com/api/?name=AI+Talent&background=random&color=fff&size=128&bold=true",
      "description": "Senior Data Engineer - AWS Specialist\n\nWe're partnering with a rapidly evolving leader in the Logistics and Supply Chain sector, dedicated to optimising complex global operations through data. For the right candidate, we are pleased to offer 482 visa sponsorship.\n\nWhat You'll Do:\n- Architect and Implement end-to-end data solutions on AWS (S3, Glue, EMR, Kinesis, Redshift).\n- Lead the design of the data lake and data warehouse.\n- Develop and optimise robust ETL/ELT data pipelines using Python or Scala.\n- Champion DevOps practises (CI/CD, Terraform).\n- Mentor and guide junior data engineers.\n\nWhat You'll Bring:\n- 6+ years of experience in Data Engineering (2+ years in a senior/lead role).\n- Expert-level experience with the AWS data ecosystem.\n- Proficiency in Python/Scala and advanced SQL.\n- Proven experience with Infrastructure as Code (IaC).\n- Strong understanding of data governance and security.\n\nVisa Information:\n482 Visa sponsorship available for eligible candidates.",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "https://www.linkedin.com/jobs/view/senior-data-engineer-aws-at-ai-talent-4360400183/"
    },
    {
      "id": 13,
      "slug": "workday-systems-support-finance-university-of-melbourne",
      "title": "Workday Systems Support Finance",
      "company": "University of Melbourne",
      "location": "Melbourne, Victoria, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Information Technology",
      "salary": "$111,275 - $120,453 AUD per year",
      "image": "https://ui-avatars.com/api/?name=University+of+Melbourne&background=random&color=fff&size=128&bold=true",
      "description": "Workday Systems Support Finance (Continuing)\n\nThe University of Melbourne takes pride in our people, who all contribute to our mission to benefit society through the transformative impact of education and research.\n\nYour Role:\nAs part of the Finance Systems Support team, you will play a crucial role in administering, maintaining, and developing the Workday Finance system. You'll collaborate with stakeholders to configure modules, troubleshoot issues, and support data management.\n\nYour Responsibilities:\n- Develop Stakeholder Relationships: Act as a trusted advisor and prioritise customer issues.\n- Support Functional Configuration: Configure Workday Finance modules and contribute to enhancements.\n- Manage Incidents & Problems: Troubleshoot issues and perform root-cause analysis.\n- Ensure Data Quality: Create and manage EIBs and validate financial transactions.\n\nWhat We Offer:\n- Salary: $111,275 - $120,453 p.a. + 17% super.\n- Flexible work arrangements and comprehensive leave provisions.\n- Salary packaging and discounted health insurance.\n- Professional development opportunities.\n\nVisa & Eligibility:\nThis role is open to overseas applicants; sponsorship (482/186/485) is an option for the right skills and experience. A Working with Children Check (WWCC) is required.",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "https://unimelb.wd105.myworkdayjobs.com/UoM_External_Career/job/Parkville/Workday-Systems-Support-Finance_JR-007597-1?source=linkedin"
    },
    {
      "id": 14,
      "slug": "baker-lake-house-daylesford",
      "title": "Baker",
      "company": "Lake House",
      "location": "Daylesford, Victoria, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Hospitality",
      "salary": "$76,515 per year + super",
      "image": "https://ui-avatars.com/api/?name=Lake+House&background=random&color=fff&size=128&bold=true",
      "description": "Baker - Lake House Regional Destination\n\nLake House is Australia's most highly awarded regional destination restaurant and hotel, situated in Daylesford. We offer the benefits of working with a professional and passionate team in an iconic hospitality destination.\n\nWhat You'll Do:\n- Preparing and baking sourdough bread loaves, baguettes, and rolls.\n- Preparing viennoiserie and pastries inclusive of glazing.\n- Kneading, maturing, cutting, moulding, mixing and shaping dough.\n- Monitoring oven temperatures and product appearance to determine baking times.\n- Operating machines which roll and mould dough.\n- Ensuring compliance with occupational health and safety regulations.\n\nWhat We're Looking For:\n- Minimum 2 years of experience in a relevant role.\n- Highest standards of delivery in a hatted or Michelin star environment.\n- Strong attention to detail and exceptional organizational skills.\n- Excellent team player with strong people and time management skills.\n\nVisa & Sponsorship:\nNomination for temporary work visa (482) and/or Permanent Residency (186) will be considered for eligible candidates.\n\nHours: Full-time (40 hours per week).",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2345913686"
    },
    {
      "id": 15,
      "slug": "occupational-therapist-living-strength-care-central-coast",
      "title": "Occupational Therapist (New Grad to Senior)",
      "company": "Living Strength Care",
      "location": "Central Coast & Gosford, NSW, Australia",
      "country": "au",
      "type": "Full-time / Part-time",
      "industry": "Healthcare",
      "salary": "Competitive salary + car allowance + super",
      "image": "https://ui-avatars.com/api/?name=Living+Strength+Care&background=random&color=fff&size=128&bold=true",
      "description": "Occupational Therapist Opportunities (New Grad to Senior)\n\nDue to strong demand we are growing our services and team. Be part of our growth journey at Living Strength Care, serving Central Coast & Gosford.\n\nWho We Are:\nSince 2007, Living Strength Care has grown into a highly respected allied health provider. We focus on quality, not quotas, and have built a team culture that empowers professionals to do their best work in a genuinely supportive environment.\n\nWhat You'll Do:\n- Conduct functional assessments, ADL evaluations, and sensory profiles.\n- Design and implement therapy programs that foster independence.\n- Recommend assistive technology and environmental modifications.\n- Collaborate with families, support coordinators, and multidisciplinary teams.\n- (Senior Roles) Provide mentoring and help develop junior team members.\n\nWhat We Offer:\n- Flexible Work: Full-Time or Part-Time opportunities with hybrid options.\n- Attractive Package: Competitive salary, car allowance, super, and CPD support.\n- Professional Development: $1,000 CPD budget and two paid study days.\n- Relocation & Sponsorship: Support available for eligible international applicants.\n\nAbout You:\n- Degree in Occupational Therapy + current AHPRA registration.\n- Driver's Licence + reliable vehicle.\n- NDIS Worker Screening Check.\n- Commitment to evidence-based, person-centred care.",
      "visaSponsorship": true,
      "publishedDate": "Jan 17, 2026",
      "externalUrl": "https://www.adzuna.com.au/details/5588994826"
    },
    {
      "id": 16,
      "slug": "gp-canberra-dpa-location-healthstaff-recruitment",
      "title": "General Practitioner (GP) - DPA Location",
      "company": "HealthStaff Recruitment",
      "location": "Canberra, ACT, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "$175/hr guarantee or 70% of billings",
      "image": "https://ui-avatars.com/api/?name=Health+Staff+Recruitment&background=random&color=fff&size=128&bold=true",
      "description": "General Practitioner (GP) - Canberra DPA Location\n\nThe ACT offers an abundance of nature with over half of the area preserved as parks and reserves. Located halfway between Melbourne and Sydney, Canberra provides a perfect lifestyle balance.\n\nThe Practice:\nOur newly renovated facility features 5 consulting rooms, a treatment room, and a dedicated room for cosmetic and skin procedures.\n\nBenefits:\n- $10,000 relocation allowance available.\n- $175 guaranteed hourly rate for 13 weeks or 70% (whichever is higher).\n- Mixed billing practice in a rare DPA location.\n- Flexible hours and days.\n- Full visa sponsorship and registration support.\n\nEligibility Requirements:\nTo be eligible, overseas trained doctors must hold postgraduate qualifications such as MRCGP (UK), MICGP (Ireland), FRACGP (AUS), FRNZCG (NZ), or CCFP (Canada). GPs from Hong Kong, Malaysia, Singapore, and various European countries with specialist qualifications are also encouraged to apply.\n\nHealthStaff Recruitment Support:\nWe manage the entire process of your registration and visa applications. Our service is free for all candidates, providing the widest choice of medical vacancies throughout Australia.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.careerone.com.au/jobview/canberra-great-place-in-the-australian-capital-territory-to-live-and-work-%E2%80%93-dpa-location/ccba4645-f38b-11f0-8e21-0231708ce3cd"
    },
    {
      "id": 17,
      "slug": "gp-raymond-terrace-nsw-healthstaff-recruitment",
      "title": "General Practitioner (GP) - Raymond Terrace",
      "company": "HealthStaff Recruitment",
      "location": "Raymond Terrace, NSW, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "$350,000+ per year",
      "image": "https://ui-avatars.com/api/?name=Health+Staff+Recruitment&background=random&color=fff&size=128&bold=true",
      "description": "General Practitioner (GP) - 30 mins from Newcastle\n\nLooking for a perfect balance between work and lifestyle? It's time to think about Australia. We are seeking a GP for a clinic in Raymond Terrace, an area famous for its beautiful river, rural views, and historic wine production.\n\nThe Practice:\nA large, modern medical centre with an established patient base, ensuring you will be busy from day one. This is a rare DPA location suitable for overseas trained GPs.\n\nBenefits:\n- 70% of billings – potential income $350,000+\n- Minimum guarantee of $200 p/h for the first 3 months.\n- Mixed billing clinic.\n- Relocation allowance of $10,000.\n- Flexible hours to ensure a healthy work/life balance.\n- Full visa sponsorship and guided registration process.\n\nEligibility Requirements:\nOverseas trained doctors must hold postgraduate qualifications in General Practice (e.g., MRCGP, MICGP, CCFP). Specialist GPs from various international hubs (UK, NZ, Ireland, etc.) may be eligible for the Expedited Specialist Registration Pathway.\n\nAbout the Area:\nRaymond Terrace is a friendly, multicultural community just 30 minutes from the vibrant city of Newcastle. It offers proximity to Maitland and Nelson Bay, providing easy access to some of the most beautiful beaches and national parks in the world.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.careerone.com.au/jobview/general-practitioner-job-in-raymond-terrace-%E2%80%93-30-minutes-from-newcastle/9de96005-f37a-11f0-8e21-0231708ce3cd"
    },
    {
      "id": 18,
      "slug": "lead-veterinarian-burpengary-vet-australia",
      "title": "Lead Veterinarian",
      "company": "Burpengary Vet",
      "location": "Burpengary, Queensland, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "Competitive",
      "image": "https://ui-avatars.com/api/?name=Burpengary+Vet&background=random&color=fff&size=128&bold=true",
      "description": "Lead Veterinarian - Full Time\n\nWe are seeking a Full-Time Lead Veterinarian to join our team at Burpengary Vet. This role offers a flexible roster with a mix of consulting and surgical caseload to suit your interests and strengths.\n\nAbout Us:\nBurpengary Vet is a brand-new, purpose-built clinic with a supportive and friendly team environment. You’ll work alongside 5–6 veterinarians and 8 dedicated support staff, including an experienced nursing team.\n\nWhat You’ll Be Doing:\n- Managing a varied caseload across medicine and surgery.\n- Mentoring, training, and supporting the GP veterinary team.\n- Shaping and upholding best-practice standards.\n- Driving clinical vision while aligning with business objectives.\n- Utilizing advanced diagnostics (digital radiography, ultrasound, in-house lab).\n- Delivering preventative healthcare and wellness checks.\n\nBenefits:\n- Competitive salary reflective of experience.\n- Free access to the VetPartners CPD Training Centre.\n- Generous CPD allowance and study leave.\n- Flexible rosters for work-life balance.\n- Relocation support available for interstate or international candidates.\n\nAbout You:\n- Qualified Veterinarian with AHPRA registration (or eligibility).\n- Ideally 4+ years’ experience in small animal practice.\n- Strong communicator and team player.",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "https://www.linkedin.com/jobs/view/veterinarian-at-vetpartners-australia-and-new-zealand-4364090363/"
    },
    {
      "id": 19,
      "slug": "sushi-chef-go-jip-k-grill-underwood",
      "title": "Sushi Chef",
      "company": "Go-Jip K Grill & Sushi Buffet",
      "location": "Underwood, Queensland, Australia",
      "country": "au",
      "type": "Full-time / Part-time",
      "industry": "Hospitality",
      "salary": "$65,000 - $73,000 per year",
      "image": "https://ui-avatars.com/api/?name=Go+Jip+K+Grill&background=random&color=fff&size=128&bold=true",
      "description": "Sushi Chef Wanted - Go-Jip K Grill & Sushi Buffet\n\nWe are currently looking for an experienced Sushi Chef to join our team in Underwood. Immediate start available for the right candidate.\n\nPosition Details:\n- Employment Type: Full-Time (38–40 hours) or Part-Time (negotiable).\n- Weekend availability (Saturday & Sunday) is essential.\n- Weekdays: Dinner service only.\n- Weekends: Full-day shifts.\n\nRequired Skills & Experience:\n- Proven experience as a Sushi Chef.\n- Ability to break down whole fish and prepare sushi toppings (neta).\n- Strong knife skills and knowledge of professional sushi preparation.\n- Ability to work efficiently in a fast-paced environment.\n- High standards of hygiene and food safety.\n\nWhat We Offer:\n- Visa sponsorship (482/Occupational) available for suitable candidates.\n- Competitive pay rate ($28 – $35 per hour for part-time).\n- Staff meals provided.\n- Friendly and supportive team environment.\n- Stable hours in a growing establishment.",
      "visaSponsorship": true,
      "publishedDate": "Jan 19, 2026",
      "externalUrl": "mailto:hisashi_no14@hotmail.co.jp"
    },
    {
      "id": 20,
      "slug": "sushi-chef-sl-bros-group-australia",
      "title": "Sushi Chef",
      "company": "SL Bros group Pty Ltd",
      "location": "Australia",
      "country": "au",
      "type": "Full-time & Part-time",
      "industry": "Hospitality",
      "salary": "$65,000 - $73,000 per year",
      "image": "https://ui-avatars.com/api/?name=SL+Bros+Group&background=random&color=fff&size=128&bold=true",
      "description": "Sushi Chef Wanted - Full-Time & Part-Time\n\nSL Bros group Pty Ltd is looking for an experienced Sushi Chef to join our team.\n\nWe are looking for someone with:\n- Proven experience as a Sushi Chef.\n- Strong knowledge of sushi preparation and fish handling.\n- Ability to work in a fast-paced environment.\n- Excellence in delivering quality customer service.\n\nWhat We Offer:\n- Competitive salary: $65,000 - $73,000 per year.\n- Visa sponsorship (482/186) for eligible candidates.\n- Full-time and Part-time options available.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.glassdoor.co.au/partner/jobListing.htm?jobListingId=1010001767225"
    },
    {
      "id": 21,
      "slug": "occupational-therapist-hacr-australia",
      "title": "Occupational Therapist - Sponsorship in Australia",
      "company": "Health and Community Recruitment",
      "location": "Sydney, NSW, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Health and Care",
      "salary": "$80,000 - $95,000 + benefits",
      "image": "https://ui-avatars.com/api/?name=Health+Community+Recruitment&background=random&color=fff&size=128&bold=true",
      "description": "Occupational Therapist - Sponsorship Opportunities in Australia\n\nHealth and Community Recruitment are specialists dedicated to connecting passionate health talent with the best opportunities across Australia. We are partnering with leading providers in Community OT and Occupational Rehabilitation.\n\nCurrent Opportunities:\n- Brisbane Community OT: Early intervention Paeds to Aged Care.\n- Occupational Rehabilitation Consultant: Regional NSW (Newcastle, Orange, Wollongong, etc.).\n- Community Aged Care OT: Hobart or Adelaide.\n- Sydney Metro: Depending on experience.\n\nWhat You'll Get:\n- Salary: AUD $80,000 - $95,000 + super + car allowance.\n- Visa sponsorship (482/186) for qualified OTs.\n- Support from leading national and independent employers.\n\nRequirements:\n- Qualified OT with a degree from the UK, Ireland, South Africa, Canada, or the USA (AHPRA registration eligible).\n- Minimum 12 months post-graduate experience.\n- Ability to obtain a car within 1 month of arrival (community-based roles).",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "mailto:aaron@hacr.com.au"
    },
    {
      "id": 22,
      "slug": "consultant-psychiatrist-sante-recruitment-victoria",
      "title": "Consultant Psychiatrist (Inpatient & Community)",
      "company": "Santé Recruitment",
      "location": "Regional Victoria, Australia",
      "country": "au",
      "type": "Full-time / Part-time",
      "industry": "Health and Care",
      "salary": "Up to $445,000 + Super",
      "image": "https://ui-avatars.com/api/?name=Sante+Recruitment&background=random&color=fff&size=128&bold=true",
      "description": "Consultant Psychiatrist – Inpatient & Community Services\n\nRegional Victoria | Earn up to $445,000 + Super | Visa & Relocation Support Available\n\nWe are seeking Consultant Psychiatrists to join a growing Mental Health Service across inpatient and community settings in regional Victoria. These roles offer genuine flexibility, strong multidisciplinary support, and the opportunity to shape services during a period of major expansion.\n\nOpportunity Highlights:\n- Full-time or part-time roles available.\n- Inpatient and community-based positions.\n- Ability to tailor your role around clinical interests: General Adult, Older Age, Addiction, Forensic, etc.\n- Joining a service with a major $217m redevelopment underway.\n- 150km from Melbourne with affordable housing and excellent schools.\n\nEligibility & Requirements:\n- Fellowship of RANZCP or equivalent.\n- UK CCST / CCT holders may be eligible for the RANZCP Expedited Specialist Pathway.\n- IMG Psychiatrists with substantial comparability are strongly encouraged to apply.\n- Eligibility for AHPRA registration.\n\nWhat’s on Offer:\n- Competitive remuneration up to $445,000 + super.\n- Relocation assistance for eligible international candidates.\n- Full visa sponsorship (482/186) available.\n- Outstanding lifestyle with easy access to beaches and national parks.",
      "visaSponsorship": true,
      "publishedDate": "Jan 17, 2026",
      "externalUrl": "https://au.linkedin.com/jobs/view/consultant-psychiatrist-at-sant%C3%A9-recruitment-4360017829"
    },
    {
      "id": 23,
      "slug": "manicurist-unique-nails-beauty-southport",
      "title": "Manicurist (Nail Technician)",
      "company": "Unique Nails & Beauty",
      "location": "Southport, Queensland, Australia",
      "country": "au",
      "type": "Full-time / Part-time",
      "industry": "Trades and Services",
      "salary": "$27 - $60 per hour",
      "image": "https://ui-avatars.com/api/?name=Unique+Nails+Beauty&background=random&color=fff&size=128&bold=true",
      "description": "Manicurist & Nail Technician - Trainees Welcome\n\nWe are seeking a dedicated and enthusiastic manicurist to join our team in Southport! No prior experience is necessary, as we offer comprehensive training to help you succeed in the beauty industry.\n\nKey Responsibilities:\n- Providing professional hand and foot treatments.\n- Performing high-quality manicures and pedicures.\n- Maintaining excellent hygiene and client care standards.\n- Learning new nail care techniques through our training program.\n\nWhat We Offer:\n- Competitive pay rate: $27 – $60 per hour based on experience.\n- Flexible shifts to suit your lifestyle.\n- Relocation assistance for suitable candidates.\n- Visa sponsorship (482/485) available for eligible applicants.\n\nAdditional Perks:\n- Professional development assistance and career growth.\n- Employee discounts and free refreshments.\n- A supportive and friendly work environment.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.glassdoor.com.au/partner/jobListing.htm?jobListingId=1010001853429"
    },
    {
      "id": 24,
      "slug": "gp-vr-non-vr-victorian-alps-wavelength-mansfield",
      "title": "General Practitioner (VR or Non-VR GP)",
      "company": "WAVELENGTH",
      "location": "Mansfield, Victoria, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "60% Billings ($15k/week potential)",
      "image": "https://ui-avatars.com/api/?name=WAVELENGTH&background=random&color=fff&size=128&bold=true",
      "description": "General Practitioner (VR or Non-VR GP) – Stunning Victorian Alps\n\nBe part of a large supportive team offering flexible hours and provide exceptional care to a vibrant community in the stunning Victorian Alps! This is a rare DPA position offering visa sponsorship and rural incentive payments.\n\nThe Practice:\nA newly renovated facility in a beautiful, modernized early 19th-century building. The facility includes 13 consulting rooms, a fully equipped kitchen, and free parking. You’ll join a highly skilled team of 10 GPs, including specialists in Anaesthetics and Obstetrics.\n\nWhat’s on Offer:\n- 60% Billings – Weekly gross billing of $15,000 for a well-established GP.\n- Level 2 and 3 supervision provided.\n- Partnership opportunities available.\n- Visa sponsorship (482/186) plus rural incentive payments.\n- Prioritized work-life balance (Mon-Fri, 8:30am - 6pm).\n\nThe Location:\nMansfield offers breathtaking natural beauty with lush forests and pristine rivers, just 30 minutes from the renowned Mount Buller Ski Resort. It combines a lively arts and culture scene with a relaxed and fulfilling regional lifestyle.\n\nEligibility:\n- GPs holding Specialist or General Registration with AHPRA.\n- Fellowship program participants (RACGP or ACRRM).\n- International candidates eligible for the PEP-Specialist Pathway.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.careerone.com.au/jobview/general-practitioner-vr-or-non-vr-gp-%E2%80%93-victorian-alps-vic-dpa-position/daf6b1c7-f272-11f0-8e21-0231708ce3cd"
    },
    {
      "id": 25,
      "slug": "head-of-department-electrical-electronic-engineering-university-of-melbourne",
      "title": "Head of Department – Electrical & Electronic Engineering",
      "company": "University of Melbourne",
      "location": "Melbourne, Victoria, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Education",
      "salary": "$236,824 p.a. + 17% super",
      "image": "https://ui-avatars.com/api/?name=University+of+Melbourne&background=random&color=fff&size=128&bold=true",
      "description": "Head of Department – Electrical & Electronic Engineering\n\nThe University of Melbourne is seeking a visionary leader to head the Department of Electrical & Electronic Engineering. This role offers a unique chance to shape the long-term vision of the department and contribute to its global impact.\n\nYour Role:\nAs the Head of Department, you will lead and inspire a team of academic professionals, aligning departmental goals with strategic plans to achieve excellence in teaching and research. You will play a pivotal role in fostering a positive and inclusive culture while building strategic partnerships with industry and academic stakeholders.\n\nYour Responsibilities:\n- Lead and Manage: Provide strategic leadership and manage resources for the department.\n- Drive Performance: Develop performance targets and enhance teaching/research programs.\n- Build Partnerships: Engage with industry, government, and academic partners globally.\n- Foster Culture: Promote diversity, inclusion, and safety while mentoring staff.\n\nWhat We Offer:\n- Salary: $236,824 p.a. + 17% super (significant retirement benefit).\n- Flexible work arrangements and comprehensive leave provisions.\n- Salary packaging and discounted health services.\n- A vibrant academic community in one of the world's most livable cities.\n\nVisa & Eligibility:\nVisa sponsorship is available for this position (482/186). A Working with Children Check (WWCC) is required for all positions.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.adzuna.com.au/details/5589893554"
    },
    {
      "id": 26,
      "slug": "restoration-technician-elite-maintenance-services-hobart",
      "title": "Restoration Technician (Carpet & Flood)",
      "company": "Elite Maintenance Services Group",
      "location": "Hobart, Tasmania, Australia",
      "country": "au",
      "type": "Part-time",
      "industry": "Trades and Services",
      "salary": "Competitive (Negotiable)",
      "image": "https://ui-avatars.com/api/?name=Elite+Maintenance&background=random&color=fff&size=128&bold=true",
      "description": "Restoration and Carpet Cleaning Technician\n\nElite Maintenance Services is looking for a motivated Restoration and Carpet Cleaning Technician to join our team in Hobart. This role offers variety, combining restoration services with carpet and upholstery cleaning.\n\nYour Responsibilities:\n- Manage water/fire damage restoration and mould remediation.\n- Perform carpet, upholstery, pest control, and flood restoration services.\n- Conduct onsite risk assessments and hazard identification.\n- Provide detailed assessment reports and maintain equipment.\n- Deliver exceptional customer service and recommend additional services.\n\nAbout You:\n- Experience in restoration and/or cleaning (carpet cleaning is a plus).\n- Valid driver’s license and legal working rights in Australia.\n- Physically fit and able to handle equipment.\n- Attention to detail with strong communication skills.\n- IICRC certification or pest control license is an advantage.\n\nWhat We Offer:\n- Competitive, negotiable salary.\n- Ongoing training and career development (IICRC, pest control, etc.).\n- A supportive team environment with a respected Australian brand.\n- Visa sponsorship (482/494) available for suitable candidates.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.adzuna.com.au/details/5590261486"
    },
    {
      "id": 27,
      "slug": "pharmacist-green-life-clinics-robina",
      "title": "Pharmacist",
      "company": "Green Life Clinics and Dispensaries",
      "location": "Robina, Queensland, Australia",
      "country": "au",
      "type": "Full-time",
      "industry": "Healthcare",
      "salary": "Competitive",
      "image": "https://ui-avatars.com/api/?name=Green+Life+Clinics&background=random&color=fff&size=128&bold=true",
      "description": "Pharmacist - Robina Shopping Centre Clinic\n\nJoin a growing, patient‑centred clinic as our new Pharmacist and enjoy a rewarding blend of clinical practice and leadership. Our mission is to simplify access to plant-based medicine and integrate it with mainstream healthcare.\n\nYour Role:\nDeliver high‑impact medication reviews, work closely with GPs to shape care pathways, and mentor a small talented team in a modern, well‑resourced setting.\n\nWhat You'll Be Doing:\n- Dispense prescriptions accurately and efficiently.\n- Provide professional medication advice and counselling to patients.\n- Review medication regimens to identify interactions or adverse effects.\n- Maintain accurate patient records and ensure regulatory compliance.\n- Work collaboratively with healthcare teams for coordinated care.\n- Train and mentor pharmacy technicians and interns.\n\nAbout You:\n- Current AHPRA Registration.\n- Keen interest to learn more about alternative and plant-based medicine.\n- Exceptional eye for detail and accuracy.\n- Ability to work and make decisions under pressure.\n\nWhat We Offer:\n- Competitive salary and generous professional development support.\n- Flexible rostering to protect work–life balance.\n- Relocation assistance and Visa sponsorship (482/186) for eligible candidates.\n- Real scope to grow your clinical career in a modern environment.",
      "visaSponsorship": true,
      "publishedDate": "Jan 18, 2026",
      "externalUrl": "https://www.adzuna.com.au/details/5590258101"
    }
  ],
  "users": [],
  "applications": []
}